package momo.kikiplus.com.kbucket.view.Bean

/**
 * 버킷 랭킹 클래스
 */
/**
 * 생성자
 */
class BucketRank {

    /**
     * 카테고리코드
     */
    /**
     * 카테고리코드 반환 메소드
     */
    /**
     * 카테고리코드 설정 메소드
     */
    var categoryCode: Int = 0
    /**
     * 카테고리명
     */
    /**
     * 카데고리명 반환 메소드
     */
    /**
     * 카데고리명 설정 메소드
     */
    var categoryName: String? = null
    /**
     * 메모내용
     */
    /**
     * 내용 반환 메소드
     */
    /**
     * 내용 설정 메소드
     */
    var content: String? = null
    /**
     * 번호
     */
    /**
     * 번호 반환 메소드
     */
    /**
     * 번호 설정 메소드
     */
    var idx: Int = 0
    /**
     * 최고에요 카운트
     */
    /**
     * 최고에요 카운트 반환 메소드
     */
    /**
     * 최고에요 카운트 설정 메소드
     */
    var bestCnt = 0
    /**
     * 좋아요 카운트
     */
    /**
     * 좋아요 카운트 반환 메소드
     */
    /**
     * 좋아요 카운트 설정 메소드
     */
    var goodCnt = 0
    /**
     * 괜찮아요 카운트
     */
    /**
     * 괜찮아요 카운트 반환 메소드
     */
    /**
     * 괜찮아요 카운트 설정 메소드
     */
    var soSoCnt = 0
    /**
     * 사용자 카운트
     */
    /**
     * 사용자 카운트 반환 메소드
     */
    /**
     * 사용자 카운트 설정 메소드
     */
    var userComment: Int = 0
}
